emacs-init.org
#+TITLE: Emacs configuration
#+AUTHOR: William Madruga
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :comments no
#+STARTUP: overview

* My config notes
  + Which-key gets activated by pressing C-h after keybindings.
  + I usually work behind a proxy. For now I have a few hacky ways to get the proxy available - need to follow-up later for better ways
  + Constantly checking out Spacemacs Layers to grab a few config that I used to like when using it.
    https://github.com/syl20bnr/spacemacs/tree/master/layers
  + OS dependencies
    + Google Roboto Mono font
    + ag
    + ripgrep

* Emacs configuration
** Loading private scripts
   #+begin_src emacs-lisp
   (load "~/.emacs.d/elisp/private.el")
   (load "~/.emacs.d/elisp/proxy.el")
   #+end_src
** Auto-save
   #+begin_src emacs-lisp
   (setq auto-save-file-name-transforms
         `((".*" "~/.emacs.d/emacs_saves/" t)))
   #+end_src

** Reduce GC frequency
   Makes the startup faster - Is this still a thing on Emacs 27+ ???
   #+begin_src emacs-lisp
   (setq gc-cons-threshold (* 50 1000 1000))
   #+end_src

** Rebuild Init and Refresh Package
   Always rebuild init and refresh package cache upon process termination;
   Taken from https://protesilaos.com/dotemacs/
   #+begin_src emacs-lisp
   (use-package emacs
     :config
     (defun prot/rebuild-emacs-init ()
       "Produce Elisp init from my Org dotemacs.
       Add this to `kill-emacs-hook', to use the newest file in the next
       session. The idea is to reduce startup time, though just by
       rolling it over to the end of a session rather than the beginning
       of it."
       (let ((init-el "~/.emacs.d/emacs-init.el")
             (init-org "~/.emacs.d/emacs-init.org"))
         (when (file-exists-p init-el)
           (delete-file init-el))
         (org-babel-tangle-file init-org init-el)))
     :hook ((kill-emacs-hook . prot/rebuild-emacs-init)))
   #+end_src

** Separate custom.el
   All customization insertion into separate file.
   FIXME: this doesn't seem to be working. I often find init.el getting updated with customizations :/
   #+begin_src emacs-lisp
   (setq custom-file "~/.emacs.d/custom.el")
   (load custom-file)
   #+end_src

** Small tweaks
   Replace selection when inserting text
   #+begin_src emacs-lisp
   (delete-selection-mode 1)
   (add-to-list 'exec-path "~/bin")
   (setenv "BROWSER" "firefox")
   #+end_src

** Housekeeping
   Undo limit to 80MB;
   Do not create backup or lock files
   #+begin_src emacs-lisp
   (setq undo-limit 80000000)
   (setq auto-save-default t)
   (setq make-backup-files nil)             ; stop creating backup~ files
   (setq create-lockfiles nil)              ; stop creating .# files
   #+end_src

** Startup time
   How long it takes to startup emacs
   #+begin_src emacs-lisp
   (add-hook
    'emacs-startup-hook
    (lambda ()
      (message "Emacs ready in %s with %d garbage collections."
               (format "%.2f seconds"
                       (float-time
                        (time-subtract after-init-time before-init-time))) gcs-done)))
   #+end_src

* UI configuration
  General UI related configuration

** GUI components
   Clean-up interface from menus and such, do not display splash and startup stuff.
   Display time and battery in modeline
   Plus minor tweaks added in.
   #+begin_src emacs-lisp
   (use-package emacs
     :init
     (menu-bar-mode -1)
     (tool-bar-mode -1)
     (scroll-bar-mode -1)
     (set-fringe-mode 10)
     (display-time-mode 1)
     (column-number-mode 1)
     (show-paren-mode 1)

     :config
     (setq use-file-dialog nil)
     (setq use-dialog-box t)
     (setq visible-bell t)
     ;; (setq inhibit-splash-screen t)
     ;; (setq inibit-startup-message t)
     ;; (setq inhibit-scratch-message t)
     (setq initial-scratch-message "")

     (fset 'yes-or-no-p 'y-or-n-p)

     (unless (equal "Batery status not available" (battery))
       (display-battery-mode 1))

     ;; Disable the pair of key bindings that involve z minimise the Emacs frame.
     ;; Disable the 'hello' file
     :bind (("C-z" . nil)
            ("C-x C-z" . nil)
            ("C-h h" . nil)))
   #+end_src

** Fullscreen
   Set fullscreen if started by emacs command
   #+begin_src emacs-lisp
   (toggle-frame-fullscreen)
   #+end_src

** Line numbers
   Enable line numbers globally then disable for a few specific modes.
   #+begin_src emacs-lisp
   (column-number-mode)
   (global-display-line-numbers-mode t)

   ;; Disable for some modes
   (dolist (mode '(org-mode-hook
                   shell-mode-hook
                   eshell-mode-hook
                   term-mode-hook))
     (add-hook mode (lambda () (display-line-numbers-mode 0))))
   #+end_src

** Themes
   Using Protesilaos modus themes and all icons.
   Remember to M-x 'all-the-icons-iinstall-fonts' when configured for the first time.
   #+begin_src emacs-lisp
   (use-package modus-vivendi-theme
     :ensure t)

   (use-package modus-operandi-theme
     :ensure t)

   (use-package all-the-icons
     :ensure t)

   (load-theme 'modus-vivendi t)

   #+end_src

** Font configuration
   #+begin_src emacs-lisp
     (defvar wmad/default-font-size 100)

     (set-face-attribute 'default nil :font "Roboto Mono Light" :height wmad/default-font-size)

     ;; Set the fixed pitch face
     ;;(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height wmad/default-font-size)
     ;;(set-face-attribute 'fixed-pitch nil :font "Roboto Mono Light" :height wmad/default-font-size)
     (set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height wmad/default-font-size)
     ;;(set-face-attribute 'fixed-pitch nil :font "Noto Sans Italic" :height wmad/default-font-size)

     ;; Set the variable pitch face
     ;; (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 130 :weight 'regular)
     (set-face-attribute 'variable-pitch nil :font "Source Code Pro" :height wmad/default-font-size :weight 'regular)
   #+end_src

* Functions
** Upload to Netsuite (deprecated)
   Runs a babashka script that uploads buffer to Netsuite.
   #+begin_src emacs-lisp
   (defun wmad/upload-to-netsuite ()
     "Send buffer to Netsuite."
     (interactive)
     (message (shell-command-to-string (concat "ns-upload" " " (buffer-file-name)))))
    #+end_src

** Shutdown emacs server
   Called from outside when when using daemon
   #+begin_src emacs-lisp
   (defun wmad/server-shutdown ()
     "Save buffers, Quit, and Shutdown (kill) server"
     (interactive)
     (save-some-buffers)
     (kill-emacs))
    #+end_src

** Duplicate line
   Copy contents and paste below current line
   #+begin_src emacs-lisp
   (defun wmad/duplicate-line ()
     (interactive)
      (let* ((cursor-column (current-column)))
       (move-beginning-of-line 1)
       (kill-line)
       (yank)
       (newline)
       (yank)
       (move-to-column cursor-column)))
    #+end_src

** Transpose Windows
   Taken from https://www.emacswiki.org/emacs/TransposeWindows
   #+begin_src emacs-lisp
   (defun wmad/transpose-windows ()
     "Transpose two windows.  If more or less than two windows are visible, error."
     (interactive)
     (unless (= 2 (count-windows))
       (error "There are not 2 windows."))
     (let* ((windows (window-list))
            (w1 (car windows))
            (w2 (nth 1 windows))
            (w1b (window-buffer w1))
            (w2b (window-buffer w2)))
       (set-window-buffer w1 w2b)
       (set-window-buffer w2 w1b)))
   #+end_src

** Quickly open files
   #+begin_src emacs-lisp
   (defun wmad/open-init-file ()
     "Open the ORG init file."
     (interactive)
     (find-file "~/.emacs.d/emacs-init.org"))

   (defun wmad/open-journal ()
     "Open the journal file."
     (interactive)
     (find-file "/run/media/wmadruga/3A3D-979D/2nd_brain/journal.org"))

   (defun wmad/open-todo ()
     "Open the TODO file."
     (interactive)
     (find-file "/run/media/wmadruga/3A3D-979D/2nd_brain/todo.org"))
   #+end_src
* Packages
** Emacs
*** Bufler
    I like to have it open at all times on the right-hand side of the screen. Switching buffers with SPC (peek) then windmove left.
    #+begin_src emacs-lisp
    (use-package bufler
      :ensure t
      :bind (("C-x b" . bufler)))
   #+end_src

*** Reduce Littering
    Keep directories clean.
    #+begin_src emacs-lisp
    (use-package no-littering
      :ensure t
      :config
      (require 'recentf)

      (defvar recentf-exclude)
      (add-to-list 'recentf-exclude no-littering-var-directory)
      (add-to-list 'recentf-exclude no-littering-etc-directory)
      (setq auto-save-file-name-transforms
            `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))
   #+end_src
*** Recentf
    Track recently-opened files.
    #+begin_src emacs-lisp
    (use-package recentf
      :config
      (setq recentf-max-saved-items 5000)
      (recentf-mode t))
   #+end_src

*** General
    One other option I've been tinkering with is <insert>
    #+begin_src emacs-lisp
    (global-unset-key (kbd "C-SPC"))

    (use-package general
      :ensure t
      :config
      (general-create-definer wmad/leader-keys
        :prefix "C-SPC"
        :global-prefix "C-SPC"))
   #+end_src

*** Amx
    #+begin_src emacs-lisp
    (use-package amx
      :ensure t
      :config (amx-mode))
   #+end_src

*** Undo-fu
    #+begin_src emacs-lisp
    (use-package undo-fu
      :ensure t
      ;;    :config (global-undo-tree-mode -1)
      )
   #+end_src

*** Terminal
    #+begin_src emacs-lisp
    (use-package vterm
      :ensure t
      :commands vterm
      :config
      (setq vterm-shell "zsh")
      (setq vterm-max-scrollback 10000))
   #+end_src

*** Which key
    Which key pane only appears if I hit C-h explicitly
    Thanks to @bartuka_
    #+begin_src emacs-lisp
    (use-package which-key
      :ensure t
      :init (which-key-mode)
      :diminish which-key-mode
      :config
      (setq which-key-show-early-on-C-h t)
      (setq which-key-idle-delay 10000)
      (setq which-key-idle-secondary-delay 0.05))
   #+end_src

