emacs-init.el
(load "~/.emacs.d/elisp/private.el")
(load "~/.emacs.d/elisp/proxy.el")

(setq auto-save-file-name-transforms
      `((".*" "~/.emacs.d/emacs_saves/" t)))

(setq gc-cons-threshold (* 50 1000 1000))

(use-package emacs
  :config
  (defun prot/rebuild-emacs-init ()
    "Produce Elisp init from my Org dotemacs.
    Add this to `kill-emacs-hook', to use the newest file in the next
    session. The idea is to reduce startup time, though just by
    rolling it over to the end of a session rather than the beginning
    of it."
    (let ((init-el "~/.emacs.d/emacs-init.el")
          (init-org "~/.emacs.d/emacs-init.org"))
      (when (file-exists-p init-el)
        (delete-file init-el))
      (org-babel-tangle-file init-org init-el)))
  :hook ((kill-emacs-hook . prot/rebuild-emacs-init)))

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

(delete-selection-mode 1)
(add-to-list 'exec-path "~/bin")
(setenv "BROWSER" "firefox")

(setq undo-limit 80000000)
(setq auto-save-default t)
(setq make-backup-files nil)             ; stop creating backup~ files
(setq create-lockfiles nil)              ; stop creating .# files

(add-hook
 'emacs-startup-hook
 (lambda ()
   (message "Emacs ready in %s with %d garbage collections."
            (format "%.2f seconds"
                    (float-time
                     (time-subtract after-init-time before-init-time))) gcs-done)))

(use-package emacs
  :init
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (set-fringe-mode 10)
  (display-time-mode 1)
  (column-number-mode 1)
  (show-paren-mode 1)

  :config
  (setq use-file-dialog nil)
  (setq use-dialog-box t)
  (setq visible-bell t)
  ;; (setq inhibit-splash-screen t)
  ;; (setq inibit-startup-message t)
  ;; (setq inhibit-scratch-message t)
  (setq initial-scratch-message "")

  (fset 'yes-or-no-p 'y-or-n-p)

  (unless (equal "Batery status not available" (battery))
    (display-battery-mode 1))

  ;; Disable the pair of key bindings that involve z minimise the Emacs frame.
  ;; Disable the 'hello' file
  :bind (("C-z" . nil)
         ("C-x C-z" . nil)
         ("C-h h" . nil)))

(toggle-frame-fullscreen)

(column-number-mode)
(global-display-line-numbers-mode t)

;; Disable for some modes
(dolist (mode '(org-mode-hook
                shell-mode-hook
                eshell-mode-hook
                term-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package modus-vivendi-theme
  :ensure t)

(use-package modus-operandi-theme
  :ensure t)

(use-package all-the-icons
  :ensure t)

(load-theme 'modus-vivendi t)

(defvar wmad/default-font-size 100)

(set-face-attribute 'default nil :font "Roboto Mono Light" :height wmad/default-font-size)

;; Set the fixed pitch face
;;(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height wmad/default-font-size)
;;(set-face-attribute 'fixed-pitch nil :font "Roboto Mono Light" :height wmad/default-font-size)
(set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height wmad/default-font-size)
;;(set-face-attribute 'fixed-pitch nil :font "Noto Sans Italic" :height wmad/default-font-size)

;; Set the variable pitch face
;; (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 130 :weight 'regular)
(set-face-attribute 'variable-pitch nil :font "Source Code Pro" :height wmad/default-font-size :weight 'regular)

(defun wmad/upload-to-netsuite ()
  "Send buffer to Netsuite."
  (interactive)
  (message (shell-command-to-string (concat "ns-upload" " " (buffer-file-name)))))

(defun wmad/server-shutdown ()
  "Save buffers, Quit, and Shutdown (kill) server"
  (interactive)
  (save-some-buffers)
  (kill-emacs))

(defun wmad/duplicate-line ()
  (interactive)
   (let* ((cursor-column (current-column)))
    (move-beginning-of-line 1)
    (kill-line)
    (yank)
    (newline)
    (yank)
    (move-to-column cursor-column)))

(defun wmad/transpose-windows ()
  "Transpose two windows.  If more or less than two windows are visible, error."
  (interactive)
  (unless (= 2 (count-windows))
    (error "There are not 2 windows."))
  (let* ((windows (window-list))
         (w1 (car windows))
         (w2 (nth 1 windows))
         (w1b (window-buffer w1))
         (w2b (window-buffer w2)))
    (set-window-buffer w1 w2b)
    (set-window-buffer w2 w1b)))

(defun wmad/open-init-file ()
  "Open the ORG init file."
  (interactive)
  (find-file "~/.emacs.d/emacs-init.org"))

(defun wmad/open-journal ()
  "Open the journal file."
  (interactive)
  (find-file "/run/media/wmadruga/3A3D-979D/2nd_brain/journal.org"))

(defun wmad/open-todo ()
  "Open the TODO file."
  (interactive)
  (find-file "/run/media/wmadruga/3A3D-979D/2nd_brain/todo.org"))

(use-package bufler
  :ensure t
  :bind (("C-x b" . bufler)))

(use-package no-littering
  :ensure t
  :config
  (require 'recentf)

  (defvar recentf-exclude)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory)
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

(use-package recentf
  :config
  (setq recentf-max-saved-items 5000)
  (recentf-mode t))

(global-unset-key (kbd "C-SPC"))

(use-package general
  :ensure t
  :config
  (general-create-definer wmad/leader-keys
    :prefix "C-SPC"
    :global-prefix "C-SPC"))

(use-package amx
  :ensure t
  :config (amx-mode))

(use-package undo-fu
  :ensure t
  ;;    :config (global-undo-tree-mode -1)
  )

(use-package vterm
  :ensure t
  :commands vterm
  :config
  (setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))

(use-package which-key
  :ensure t
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-show-early-on-C-h t)
  (setq which-key-idle-delay 10000)
  (setq which-key-idle-secondary-delay 0.05))
