emacs-init.el

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

(use-package diminish
  :ensure t
  :after use-package)

(use-package try
  :ensure t)

(use-package restart-emacs
  :ensure t )

(use-package helpful
  :ensure t)

(use-package switch-window
  :ensure t)

(use-package dashboard
  :ensure t
  :config
  (setq dashboard-items
        '((recents . 5)
          (projects . 5)
          (bookmarks . 5)
          (agenda . 20)))
  (setq dashboard-set-init-info t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                  (bookmarks . "book")))
  (dashboard-setup-startup-hook))

(use-package company
  :ensure t
  :after lsp-mode
  :bind (:map company-active-map
              ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(add-hook 'after-init-hook 'global-company-mode)

(use-package company-box
  :ensure t
  :hook (company-mode . company-box-mode))

(use-package projectile
  :ensure t
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ido))
  :bind-keymap ("C-c p" . projectile-command-map)
  :init
  (when (or (file-directory-p "~/src") (file-directory-p "~/git"))
    (setq projectile-project-search-path '("~/src" "~/git")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package ag
  :ensure t)

(use-package ripgrep
  :ensure t)

(use-package magit
  :ensure t
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package rainbow-delimiters
  :ensure t
  :diminish
  :hook (prog-mode-hook . rainbow-delimiters-mode))

(use-package yasnippet
  :ensure t
  :config (yas-global-mode 1))

(use-package yasnippet-snippets
  :ensure t)

(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode t))

(use-package smartparens
  :ensure t)

(use-package origami
  :ensure t)
(global-origami-mode)

(use-package indent-guide
  :ensure t
  :hook (prog-mode-hook . indent-guide-mode))

(setq-default indent-tabs-mode nil
              fill-column 140
              tab-width 2)

(defun wmad/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . efs/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

(use-package company-lsp
  :ensure t)

(use-package lsp-ui
  :ensure t
  :hook (lsp-mode-hook . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(add-hook 'prog-mode-hook 'flyspell-prog-mode) ;; spell Check

(use-package restclient
  :ensure t)

(use-package dumb-jump
  :ensure t)
(add-hook 'xref-backend-functions #'dumb-jump-xref-activate)

(use-package js2-mode
  :ensure t)

(use-package js2-refactor
  :ensure t
  :config (add-hook 'js2-mode-hook #'js2-refactor-mode))

(use-package eglot
  :ensure t)

(setq js-indent-level 2)

(add-hook 'js-mode-hook #'smartparens-mode)
(add-hook 'js2-mode-hook 'lsp-deferred)
(add-hook 'lsp-mode-hook 'lsp-enable-which-key-integration)
(add-hook 'js-mode-hook 'eglot-ensure)
(add-hook 'js2-mode-hook 'eglot-ensure)

;; Flycheck configs

;; disable jshint
(setq-default flycheck-disabled-checkers
              (append flycheck-disabled-checkers
                      '(javascript-jshint)))

;; enable eslint
(flycheck-add-mode 'javascript-eslint 'js2-mode)

(setq-default flycheck-temp-prefix ".flycheck")

;; disable json-jsonlist checking for json files
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(json-jsonlist)))

(use-package cider
  :ensure t)

(use-package clojure-mode
  :ensure t)

(use-package clojure-snippets
  :ensure t)

(use-package clj-refactor
  :ensure t)

(defun my-clojure-mode-hook ()
    (clj-refactor-mode 1)
    (yas-minor-mode 1))

(add-hook 'clojure-mode-hook #'my-clojure-mode-hook)

(use-package suggest
  :ensure t)
(add-hook 'emacs-lisp-mode-hook #'smartparens-mode)

(use-package s
  :ensure t)

(use-package dash
  :ensure t)

(use-package slime
  :ensure t
    :config
  (setq inferior-lisp-program "sbcl")
  (setq scheme-program-name "scheme"))

;; try out sly: https://github.com/joaotavora/sly 
;; (use-package sly
;;   :ensure t)

(load-file "~/src/netsuite-mode.el/netsuite.el")
(add-to-list 'auto-mode-alist '("\\.js\\'" . netsuite-mode))

(defun wmad/org-mode-setup ()
  (org-indent-mode)
  (visual-line-mode 1)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (diminish org-indent-mode))

(defun wmad/org-font-setup ()
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (dolist (face '((org-level-1 . 1.7)
                  (org-level-2 . 1.5)
                  (org-level-3 . 1.3)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "Roboto Mono Light" :weight 'regular :height (cdr face)))

  (require 'org-indent)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(defun wmad/org-mode-visual-fill ())
  ;; (setq visual-fill-column-width 200
  ;; visual-fill-column-center-text t)
  ;; (visual-fill-column-mode 1))

(use-package org
  :hook (org-mode-hook . wmad/org-mode-setup)
  :config
