emacs-init.el
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 0
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-startup-folded 'content
        org-cycle-separator-lines 2)
  (wmad/org-font-setup))

(use-package org-superstar
  :ensure t
  :after org
  :config
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))

(use-package org-super-agenda
  :ensure t
  :after org-agenda
  :config
  (org-super-agenda-mode)
  (let ((org-super-agenda-groups
         '((:auto-group t)))))
  (setq org-agenda-window-setup 'current-window))

(use-package visual-fill-column
  :defer t
  :hook (org-mode-hook . wmad/org-mode-visual-fill))

(setq org-log-into-drawer t)
(setq org-agenda-files "~/.emacs.d/elisp/agenda-files.el")

(require 'org-habit)

(add-to-list 'org-modules 'org-habit)

(setq org-habit-graph-column 60)

(setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "STRT(s)"  "WAIT(w)"  "|" "DONE(d!)")))

(setq org-todo-keyword-faces
  '(("TODO" . (:foreground "orange red" :weight bold))
    ("NEXT" . (:foreground "yellow" :weight bold))
    ("STRT" . (:foreground "green" :weight bold))
    ("WAIT" . (:foreground "MediumPurple3" :weight bold))
    ("DONE" . (:foreground "blue" :weight bold))))

(defvar +org-capture-journal-file "/run/media/wmadruga/3A3D-979D/2nd_brain/journal.org")

(setq org-capture-templates
      '(("j" "Journal" entry
   (file+olp+datetree +org-capture-journal-file)
   "* %U %?\n%i\n%a" :prepend t)))

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("elisp" . "src emacs-lisp"))

(use-package window
  :init
  (setq display-buffer-alist
        '(
          ("^\\(\\*Bufler.*\\|\\*Help.*\\).*"
           (display-buffer-in-side-window)
           (window-height . 0.35)
           (side . right)
           (slot . 1))

          ("^\\(\\*e?shell\\|vterm\\|*HTTP.*\\|*Async.*\\|*ag.*\\).*"
           (display-buffer-in-side-window)
           (window-height . 0.15)
           (side . bottom)
           (slot . 0))))

  (setq window-combination-resize t)
  (setq even-window-sizes 'height-only)
  (setq window-sides-vertical nil)
  (setq switch-to-buffer-in-dedicated-window 'pop)
  :hook ((help-mode-hook . visual-line-mode)
         (custom-mode-hook . visual-line-mode)))

(use-package dired
  :commands (dired dired-jump)
  :custom ((dired-listing-switches "-agho --group-directories-first")))

(use-package dired-single
  :ensure t)

(use-package all-the-icons-dired
  :ensure t
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :ensure t
  :config
  (setq dired-open-extensions '(("png" . "feh")
                                ("mkv" . "mpv")
                                ("mp3" . "mpv")
                                ("pdf" . "acroread")
                                )))

(use-package dired-hide-dotfiles
  :ensure t
  :hook (dired-mode . dired-hide-dotfiles-mode))

(use-package dired-sidebar
  :ensure t
  :commands (dired-sidebar-toggle-sidebar)
  :config
  (setq dired-sidebar-theme 'icons)
  (setq dired-sidebar-refresh-on-projectile-switch t)
  (setq dired-sidebar-should-follow-file t)
  (setq dired-sidebar-one-instance-p t))

;; https://github.com/crocket/dired-single/tree/98c2102429fcac6fbfdba9198c126eb1b3dcc4e5
(defun my-dired-init ()
  "Bunch of stuff to run for dired, either immediately or when it's
   loaded."
  ;; <add other stuff here>
  (define-key dired-mode-map [remap dired-find-file]
    'dired-single-buffer)
  (define-key dired-mode-map [remap dired-mouse-find-file-other-window]
    'dired-single-buffer-mouse)
  (define-key dired-mode-map [remap dired-up-directory]
    'dired-single-up-directory))

;; if dired's already loaded, then the keymap will be bound
(if (boundp 'dired-mode-map)
    ;; we're good to go; just add our bindings
    (my-dired-init)
  ;; it's not loaded yet, so add our bindings to the load-hook
  (add-hook 'dired-load-hook 'my-dired-init))

(global-set-key (kbd "C-z")   'undo-fu-only-undo)
(global-set-key (kbd "C-S-z") 'undo-fu-only-redo)

(global-set-key (kbd "C-x o")     'switch-window)
(global-set-key (kbd "s-<left>")  'windmove-left)
(global-set-key (kbd "s-<right>") 'windmove-right)
(global-set-key (kbd "s-<up>")    'windmove-up)
(global-set-key (kbd "s-<down>")  'windmove-down)

(global-set-key (kbd "C-h f")   #'helpful-callable)
(global-set-key (kbd "C-h v")   #'helpful-variable)
(global-set-key (kbd "C-h k")   #'helpful-key)
(global-set-key (kbd "C-c C-d") #'helpful-at-point)
(global-set-key (kbd "C-h F")   #'helpful-function)
(global-set-key (kbd "C-h C")   #'helpful-command)

(wmad/leader-keys
  "e"   '(wmad/open-init-file :which-key "Open init file")
  "j"   '(wmad/open-journal :which-key "Open journal file")
  "T"   '(wmad/open-todo :which-key "Open todo file")
  "k"   '(kill-buffer :which-key "Kill buffer")
  "SPC" '(projectile-find-file :which-key "Project Find File")
  "R"   '(restart-emacs :which-key "Restart Emacs")
  "v"   '(vterm :which-key "Terminal"))

(wmad/leader-keys
  "d"     '(:ignore t :which-key "Dired")
  "dd"    '(dired-hide-dotfiles-mode :which-key "Hide dotfiles")
  "dj"    '(dired-jump :which-key "Jump")
  "ds"    '(dired-sidebar-show-sidebar :which-key "Show sidebar")
  "dh"    '(dired-sidebar-hide-sidebar :which-key "Hide sidebar")
  "d RET" '(dired-single-buffer :which-key "Single buffer"))

(wmad/leader-keys
  "o"  '(:ignore t :which-key "Org-Mode")
  "oa" '(org-agenda :which-key "Agenda")
  "oc" '(org-capture :which-key "Capture")
  "ol" '(org-insert-link :which-key "Insert Link")
  "oo" '(org-open-at-point :which-key "Open Link"))

(wmad/leader-keys
  "p"  '(:ignore t :which-key "Project")
  "pc" '(projectile-command-map :which-key "All commands")
  "pf" '(projectile-find-file :which-key "Find File")
  "pp" '(projectile-switch-project :which-key "Switch Project")
  "pk" '(projectile-kill-buffers :which-key "Kill Buffers")
  "ps" '(projectile-ag :which-key "Silver Search")
  "pS" '(projectile-ripgrep :which-key "Ripgrep Search"))

(wmad/leader-keys
  "G"  '(:ignore t :which-key "Magit")
  "Gs" '(magit-status :which-key "Status")
  "Gb" '(magit-blame :which-key "Blame")
  "Gl" '(magit-log :which-key "Log")
  "Gf" '(magit-fetch :which-key "Fetch")
  "G <down>" '(magit-pull :which-key "Pull")
  "G <up>" '(magit-push :which-key "Push"))

(wmad/leader-keys
  "t"  '(:ignore t :which-key "Toggle")
  "td" '(dired-sidebar-toggle-sidebar :which-key "dired sidebar")
  "tf" '(toggle-frame-fullscreen :which-key "fullscreen")
  "th" '(load-theme :which-key "choose theme")
  "tm" '(menu-bar-mode :which-key "menu bar")
  "to" '(global-origami-mode :which-key "origami")
  "tt" '(bufler-tabs-mode :which-key "bufler tab bar"))

(wmad/leader-keys
  "n"  '(:ignore t :which-key "Netsuite")
  "nc" '(netsuite/create-project :which-key "Create Project")
  "nd" '(netsuite/deploy :which-key "Deploy Project")
  "nu" '(netsuite/upload-buffer :which-key "Upload buffer"))

(wmad/leader-keys
