emacs-init.el
  "w"  '(:ignore t :which-key "Window")
  "wt" '(wmad/transpose-windows :which-key "Transpose")
  "wo" '(switch-window :which-key "Switch")
  "w-" '(split-window-below :which-key "Split below")
  "w=" '(split-window-right :which-key "Split right")
  "w0" '(delete-window :which-key "Delete this")
  "w1" '(delete-other-windows :which-key "Delete others")
  "w5" '(delete-frame :which-key "Delete frame")
  "w_" '(balance-windows :which-key "Balance")
  "wq" '(window-toggle-side-windows :which-key "Toggle Side windows"))

(general-define-key
 "C-c <down>" 'wmad/duplicate-line
 "C-c d" 'delete-trailing-whitespace)

(wmad/leader-keys
  "b"         '(:ignore t :which-key "Buffer")
  "bb"        '(bufler :which-key "Buffer Window")
  "bs"        '(bufler-switch-buffer :which-key "Switch Buffer")
  "b <right>" '(next-buffer :which-key "Next")
  "b <left>"  '(previous-buffer :which-key "Previous"))

(wmad/leader-keys
  "z"  '(:ignore t :which-key "Origami")
  "za" '(origami-toggle-node :which-key "Toggle node")
  "zo" '(origami-open-node :which-key "Open")
  "zc" '(origami-close-node :which-key "Close"))

(wmad/leader-keys
  "g"  '(:ignore t :which-key "Go to...")
  "gd" '(dumb-jump-go :which-key "go dumb")
  "gb" '(xref-pop-marker-stack :which-key "go back"))
